Documents/БП_Оповещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>БП_Оповещение</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатВыполнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стартован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Завершен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Гиперссылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткрыватьФорму</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГиперссылкаСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеСсылки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтарыйСрок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктураПараметров</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйСрок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокИсполнителей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыполнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/БП_Оповещение/Ext/ManagerModule.bsl
Функция ФормаВыполненияЗадачи(ЗадачаСсылка, ТочкаМаршрутаСсылка, Выборка) Экспорт
	
	Если ТочкаМаршрутаСсылка = БизнесПроцессы.Поручение.ТочкиМаршрута.Действие2 Тогда 
		ИмяФормы = "БизнесПроцесс.Поручение.Форма.ФормаИсполнения";
		
	ИначеЕсли ТочкаМаршрутаСсылка = БизнесПроцессы.Поручение.ТочкиМаршрута.Действие3 Тогда 
		ИмяФормы = "БизнесПроцесс.Поручение.Форма.ФормаКонтроля";
	КонецЕсли;	
		
	Результат = Новый Структура;
	Результат.Вставить("ПараметрыФормы", Новый Структура("Ключ, ТочкаМаршрута, Исполнитель, Должность",
			ЗадачаСсылка, ТочкаМаршрутаСсылка.Имя, Выборка.Исполнитель, Выборка.Должность));
	Результат.Вставить("ИмяФормы", ИмяФормы);
	Возврат Результат;
	
КонецФункции

Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.БП_Оповещение.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	БП_Оповещение.Ссылка,
	|	БП_Оповещение.Автор,
	|	БП_Оповещение.Дата,
	|	БП_Оповещение.ДатаНачала,
	|	БП_Оповещение.Номер,
	|	БП_Оповещение.Описание,
	|	БП_Оповещение.СписокИсполнителей.(
	|		НомерСтроки,
	|		Исполнитель,
	|		Исполнено,
	|		Комментарии,
	|		ДатаВыполнения
	|	)
	|ИЗ
	|	Документ.БП_Оповещение КАК БП_Оповещение
	|ГДЕ
	|	БП_Оповещение.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ЗапросПоФайлам = Новый Запрос;
	ЗапросПоФайлам.Текст = 
	"ВЫБРАТЬ
	|	ФайлыДокументыПоФайлу.ВладелецФайла КАК Владелец,
	|	ФайлыДокументыПоФайлу.Ссылка КАК Файл
	|ИЗ
	|	Справочник.Файлы.ДокументыПоФайлу КАК ФайлыДокументыПоФайлу
	|ГДЕ
	|	ФайлыДокументыПоФайлу.ВладелецФайла В(&ВладелецФайла)
	|	И ВЫРАЗИТЬ(ФайлыДокументыПоФайлу.ВладелецФайла КАК Документ.БП_Оповещение).Автор = ФайлыДокументыПоФайлу.Ссылка.Автор";
	ЗапросПоФайлам.УстановитьПараметр("ВладелецФайла", Ссылка);
	ВыборкаПоФайлам = ЗапросПоФайлам.Выполнить().Выбрать();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПрикрепление = Макет.ПолучитьОбласть("Прикрепление");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСписокИсполнителейШапка = Макет.ПолучитьОбласть("СписокИсполнителейШапка");
	ОбластьСписокИсполнителей = Макет.ПолучитьОбласть("СписокИсполнителей");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		Пока ВыборкаПоФайлам.Следующий() Цикл
			если Выборка.Ссылка = ВыборкаПоФайлам.Владелец тогда
				ОбластьПрикрепление.Параметры.Вложение = "Прикрепленный файл: " + Строка(ВыборкаПоФайлам.Файл);
				ОбластьПрикрепление.Параметры.РасшифровкаВложение = ВыборкаПоФайлам.Файл;// Новый Структура("Файл", ВыборкаПоФайлам.Файл);
				ТабДок.Вывести(ОбластьПрикрепление);
			КонецЕсли;
		КонецЦикла;
		
		ТабДок.Вывести(ОбластьСписокИсполнителейШапка);
		ВыборкаСписокИсполнителей = Выборка.СписокИсполнителей.Выбрать();
		Пока ВыборкаСписокИсполнителей.Следующий() Цикл
			ОбластьСписокИсполнителей.Параметры.Заполнить(ВыборкаСписокИсполнителей);
			ТабДок.Вывести(ОбластьСписокИсполнителей, ВыборкаСписокИсполнителей.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
